In [1]:
import numpy as np
import pandas as pd

In [2]:
def make_df(cols, ind):
    data = {c: [str(c) + str(i) for i in ind] for c in cols}
    return pd.DataFrame(data, ind)

In [3]:
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [5]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])

df1

    A   B
1  A1  B1
2  A2  B2

In [6]:
df2

    A   B
3  A3  B3
4  A4  B4

In [7]:
pd.concat([df1, df2])

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [8]:
df3 = make_df('AB', [1, 2])
df4 = make_df('AB', [1, 2])

In [9]:
df3

    A   B
1  A1  B1
2  A2  B2

In [10]:
df4

    A   B
1  A1  B1
2  A2  B2

In [17]:
try:
    col_df = pd.concat([df3, df4], axis='columns', verify_integrity=False)
except ValueError as e:
    print(e)
    
col_df

    A   B   A   B
1  A1  B1  A1  B1
2  A2  B2  A2  B2

In [18]:
df1

    A   B
1  A1  B1
2  A2  B2

In [19]:
df2

    A   B
3  A3  B3
4  A4  B4

In [20]:
x = df1.copy()
y = df2.copy()
y.index = x.index

In [21]:
x

    A   B
1  A1  B1
2  A2  B2

In [22]:
y

    A   B
1  A3  B3
2  A4  B4

In [23]:
pd.concat([x, y])

    A   B
1  A1  B1
2  A2  B2
1  A3  B3
2  A4  B4

In [25]:
dup_df = pd.concat([x, y], keys=['x', 'y'])
dup_df

      A   B
x 1  A1  B1
  2  A2  B2
y 1  A3  B3
  2  A4  B4

In [26]:
dup_df.loc['x']

    A   B
1  A1  B1
2  A2  B2

In [27]:
pd.concat([x, y], ignore_index=True)

    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4

In [28]:
s1 = pd.Series([1, 2, 3])
s2 = pd.Series([3, 4, 5])

s1

0    1
1    2
2    3
dtype: int64

In [29]:
s2

0    3
1    4
2    5
dtype: int64

In [31]:
pd.concat([s1, s2], ignore_index=True)

0    1
1    2
2    3
3    3
4    4
5    5
dtype: int64

In [32]:
[1, 2, 3] + [4, 5, 6]

[1, 2, 3, 4, 5, 6]

In [34]:
s1.append(s2)

0    1
1    2
2    3
0    3
1    4
2    5
dtype: int64

In [43]:
# Example of one to one merge
df1 = pd.DataFrame({"name": ['Bob', 'Alice', 'Eve'], "group" :['A', 'B', 'B']})
df2 = pd.DataFrame({"name": ['Eve', 'Alice', 'Bob'], "number" : [1, 2, 3]})

In [41]:
df1

    name group
0    Bob     A
1  Alice     B
2    Eve     B

In [44]:
df2

    name  number
0    Eve       1
1  Alice       2
2    Bob       3

In [45]:
pd.merge(df1, df2)

    name group  number
0    Bob     A       3
1  Alice     B       2
2    Eve     B       1

In [52]:
# Many-to-One
df3 = pd.DataFrame({
    "group": ['A', 'B', 'C'],
    "skill": ['math', 'programming', 'biology']
})
df3

  group        skill
0     A         math
1     B  programming
2     C      biology

In [48]:
pd.merge(df1, df3)

    name group        skill
0    Bob     A         math
1  Alice     B  programming
2    Eve     B  programming

In [49]:
# Many-to-Many
df4 = pd.DataFrame({
    'group': ['A', 'B', 'B'],
    'leaders': ['Jack', 'John', 'Jill']
})
df4

  group leaders
0     A    Jack
1     B    John
2     B    Jill

In [51]:
pd.merge(df1, df4)

    name group leaders
0    Bob     A    Jack
1  Alice     B    John
2  Alice     B    Jill
3    Eve     B    John
4    Eve     B    Jill